<a href="https://colab.research.google.com/github/sergio-okamoto/aulas_univesp/blob/main/ms.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
uri = "https://raw.githubusercontent.com/sergio-okamoto/aulas_univesp/main/ms.csv"
mega = pd.read_csv(uri, error_bad_lines = False, encoding='latin 1')
mega.head()

  Id Data do Sorteio  Coluna 1  ...  Coluna 4  Coluna 5  Coluna 6
0  1       3/11/1996       4.0  ...      33.0      41.0      52.0
1  2       3/18/1996       9.0  ...      41.0      43.0      49.0
2  3       3/25/1996      10.0  ...      30.0      36.0      47.0
3  4        4/1/1996       1.0  ...      27.0      42.0      59.0
4  5        4/8/1996       1.0  ...      16.0      19.0      46.0

[5 rows x 8 columns]

In [2]:
mega.describe()

          Coluna 1     Coluna 2  ...     Coluna 5     Coluna 6
count  2350.000000  2350.000000  ...  2350.000000  2350.000000
mean      8.620000    17.266383  ...    43.564681    52.214468
std       7.029151     9.126873  ...     9.039096     6.925988
min       1.000000     2.000000  ...    11.000000    22.000000
25%       3.000000    10.000000  ...    38.000000    49.000000
50%       7.000000    16.000000  ...    45.000000    54.000000
75%      12.000000    23.000000  ...    51.000000    58.000000
max      50.000000    51.000000  ...    59.000000    60.000000

[8 rows x 6 columns]